---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningNegativeHeight
source: html/88f2f8f0-d495-dab8-86ee-931682dc0ff8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningNegativeHeight Property

The top of the Opening is lower than the bottom of the Opening or coincident with it.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningNegativeHeight { get; }
```